VictoriaDigital/clawreach/examples/clawreach/sdkconfig.defaults
# ClawReach ESP-IDF Configuration
# Based on SenseCAP Watcher defaults with WebSocket additions

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# TLS - allow self-signed certs for local servers
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

CONFIG_ESP_EVENT_POST_FROM_ISR=n

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

# MBEDTLS
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# LVGL Display
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_32=y

# WebSocket Client
CONFIG_ESP_WEBSOCKET_CLIENT_ENABLE=y
CONFIG_WEBSOCKET_BUFFER_SIZE_BYTES=65536

# Camera
CONFIG_ESP_CAMERA_ENABLE=y
